[
  {
    "event_key": "13",
    "active": "Y",
    "name": "Stop Stalling! Delivering Fast Video without the Buffering",
    "event_start": "2019-01-24 15:00:00",
    "event_end": "2019-01-24 15:45:00",
    "event_type": "Web",
    "event_subtype": "Conference",
    "description": "Video is one of the fastest growing mediums on the web and in mobile applications. Video files have been shown to increase engagement, and can be a great way to deliver your message quickly. &nbsp;(And who doesn’t love animated GIFs?)<br>However, video that takes a long time to start up leads to frustration and abandonment. &nbsp;The same goes for video that stalls during playback. &nbsp;In this talk, you’ll learn best practices to optimize the delivery of your video to you customers, ensuring fast delivery and minimizing stalls for a great customer experience.<br><br>",
    "seats": "0",
    "goers": "5",
    "invite_only": "N",
    "venue": "Chrome 2 + 3 + 4",
    "company": "Français",
    "id": "0583968744080b33d97350406ed0e3a6",
    "venue_id": "836698",
    "speakers": "Doug Sillars"
  },
  {
    "event_key": "33",
    "active": "Y",
    "name": "Una-Gitlab",
    "event_start": "2019-01-24 16:00:00",
    "event_end": "2019-01-24 16:45:00",
    "event_type": "DevOps / Cloud / Container & Scaling",
    "event_subtype": "Conference",
    "description": "A l&rsquo;image de Perceval et Karadock, Logan et Kevin reviennent d&rsquo;une qu&ecirc;te dans la contr&eacute;e de Gitlab et vont vous compter leurs aventures pleines de d&eacute;couvertes et de rebondissements. L&rsquo;on esp&egrave;re que P&egrave;re Blaise r&eacute;ussira &agrave; prendre des notes&hellip;<br />Lors de cette qu&ecirc;te, il a &eacute;t&eacute; n&eacute;cessaire de mettre en place une int&eacute;gration continue pour une arm&eacute;e de d&eacute;veloppeurs sanguinaires qui avaient plein de besoins tout bizarres&hellip; Et &agrave; la force de leur &eacute;p&eacute;e, de leur courage et pas du tout de l&rsquo;aide de Merlin (qui sait toujours rien faire&hellip;), Logan et Kevin mis &agrave; disposition une CI compl&egrave;te avec job, stage, int&eacute;gration avec des outils externes (PostgreSQL, Artifactory, Google Cloud Platform&hellip;) tout en la gardant simple et versionnable.<br />Ils finiront m&ecirc;me par la pr&eacute;sentation d&rsquo;un r&eacute;cent sortil&egrave;ge qui permet d&rsquo;envoyer leur CI dans le Cloud de Google avec Kubernetes. Cela donne une solution hautement scalable et performante, &agrave; la demande avec Google Kubernetes Engine afin de vous pr&eacute;senter une solution scallable et automatique !<br /><br /><strong>Lien vers les slides</strong>:&nbsp;http://bit.ly/unagitlab",
    "seats": "0",
    "goers": "15",
    "invite_only": "N",
    "venue": "Chrome 1",
    "company": "Français",
    "id": "0c41f815a1e4999f6470f06f4ec17b4e",
    "venue_id": "836691",
    "speakers": "Kevin Davin, Logan Weber"
  },
  {
    "event_key": "44",
    "active": "Y",
    "name": "Micro Frontends – a strive for fully verticalized systems",
    "event_start": "2019-01-24 14:00:00",
    "event_end": "2019-01-24 14:45:00",
    "event_type": "Architecture",
    "event_subtype": "Conference",
    "description": "Microservices brought us significant benefits, which allow us to structure teams based on business capabilities, improve scalability and enable the flexibility of being polyglot. Unfortunately, these powerful architectures are often complemented by a feature-rich browser application which ends up way too often in the creation of as a single, big and sprawling frontend-monolith. The approach of micro frontends is an effective strategy to tackle this problem and first appeared at the end of 2016 on the ThoughtWorks Technology Radar. By going into detail about the idea of extending the concepts of microservices to the frontend world, the importance of end-to-end verticals, the difference of an orchestration- or choreography-based implementation, and the trade-offs in reusability become reasonable. Upon a closer look at the advantages and challenges we've experienced in customer projects, it turns out that micro frontends are not a silver bullet either. Rather, they are suited for a specific set of problems. In a nutshell, micro frontends can be a powerful tool to avoid frontend monoliths and this talk will give you the needed knowledge to decide if it’s the right one for the job.",
    "seats": "0",
    "goers": "38",
    "invite_only": "N",
    "venue": "Titane 2",
    "company": "English",
    "id": "0d7bbcf91167e2bc4c2a92e3ab5aa7fd",
    "venue_id": "836688",
    "speakers": "David Leitner"
  },
  {
    "event_key": "57",
    "active": "Y",
    "name": "Meet & Greet",
    "event_start": "2019-01-24 16:50:00",
    "event_end": "2019-01-24 18:30:00",
    "description": "Meet & Greet ! Après cette première journée de conférence, un petit moment de détente pour discuter et échanger entre participants, speakers et sponsors. Taillons un bout de gras et de discussion dans la joie et la bonne humeur tous ensemble !",
    "seats": "0",
    "goers": "73",
    "invite_only": "N",
    "venue": "Hall Sponsors",
    "id": "0da5ac87425f4b5d3fa4bb4b6e3afc38",
    "venue_id": "836676"
  },
  {
    "event_key": "35",
    "active": "Y",
    "name": "Kiali pour mieux observer ses microservices",
    "event_start": "2019-01-25 11:00:00",
    "event_end": "2019-01-25 11:45:00",
    "event_type": "Architecture",
    "event_subtype": "Conference",
    "description": "L'architecture microservices a de nombreux avantages (modularit&eacute;, d&eacute;veloppement plus agile et passage &agrave; l'&eacute;chelle entre autres). Mais elle apporte &eacute;galement son lot de challenges propres &agrave; tous les syst&egrave;mes distribu&eacute;s : r&eacute;seau, s&eacute;curit&eacute;, t&eacute;l&eacute;m&eacute;trie, versionnage, etc.<br /> <br /> Alli&eacute;es &agrave; <a href=\"https://kubernetes.io/\" target=\"_blank\">Kubernetes</a>, des solutions de service mesh comme <a href=\"https://istio.io/\" target=\"_blank\">Istio</a> offrent une plateforme qui lib&egrave;rent les d&eacute;veloppeurs de ces pr&eacute;occupations. Mais il reste crucial de pouvoir observer et interroger son syst&egrave;me en temps r&eacute;el : quelle est la topologie de mes services ? Quels sont les services affect&eacute;s par un incident ? Pourquoi une requ&ecirc;te est-elle si lente ou &eacute;choue ?<br /> <br /> Apr&egrave;s une introduction d'Istio, nous verrons au travers d'une d&eacute;monstration comment <a href=\"https://www.kiali.io/\" target=\"_blank\">Kiali</a> permet de r&eacute;pondre &agrave; toutes ces questions (et bien d'autres).<br />Lien vers le code demo =&gt; <a href=\"https://github.com/simonpasquier/snowcamp-io-kiali\" target=\"_blank\">https://github.com/simonpasquier/snowcamp-io-kiali</a>",
    "seats": "0",
    "goers": "24",
    "invite_only": "N",
    "venue": "Amphi",
    "company": "Français",
    "id": "11868364185b3fc8d6902faed06a198b",
    "venue_id": "836673",
    "speakers": "Simon Pasquier"
  },
  {
    "event_key": "6",
    "active": "Y",
    "name": "Go(lang) soyez plus fort que le garbage collector grâce l'escape analysis",
    "event_start": "2019-01-24 10:45:00",
    "event_end": "2019-01-24 11:30:00",
    "event_type": "Language & Paradigms",
    "event_subtype": "Conference",
    "description": "Les caractéristiques du langage Go sont multiples: la concurrence, le typage statique et sa gestion de la mémoire par Garbage Collector. Mais bien avant que ce Garbage Collector entre en jeu le compilateur Go optimise la gestion de la mémoire en fonction de votre code grâce à ce qu’on appelle l’escape analysis. Voyons ensemble comment optimiser votre code Go pour limiter l'empreinte mémoire et moins solliciter le garbage collector et donc le CPU. Grâce à ces explications vous pourrez enfin y voir plus clair lorsque vous devrez choisir entre utiliser un pointeur ou pas mais aussi avoir une bonne perception de la mémoire de votre application",
    "seats": "0",
    "goers": "5",
    "invite_only": "N",
    "venue": "Chrome 1",
    "company": "Français",
    "id": "1e2011dc6f43f7dfb1321160c4ac22e4",
    "venue_id": "836691",
    "speakers": "Benjamin Coenen, François Samin"
  },
  {
    "event_key": "25",
    "active": "Y",
    "name": "WebAuthn, l'authentification (presque) sans les mains",
    "event_start": "2019-01-25 15:00:00",
    "event_end": "2019-01-25 15:45:00",
    "event_type": "Web",
    "event_subtype": "Conference",
    "description": "L'API WebAuthentication propose de r&eacute;volutionner l'authentification sur Internet en r&eacute;l&eacute;guant le mot de passe aux oubliettes !<br /> Dans cette pr&eacute;sentation nous verrons les enjeux et les probl&egrave;mes que posent l'authentification actuelle et pourquoi WebAuthn est une des solutions les plus s&eacute;curis&eacute;es &agrave; l'heure actuelle.<br /> La deuxi&egrave;me partie de la pr&eacute;sentation montrera concr&egrave;tement comment mettre cela en place sur un site Web.<br />Vous pouvez retrouver les slides et le code sur le d&eacute;p&ocirc;t GitHub suivante : <a href=\"https://github.com/joow/webauthn-demo\" target=\"_blank\">https://github.com/joow/webauthn-demo</a>",
    "seats": "0",
    "goers": "23",
    "invite_only": "N",
    "venue": "Chrome 1",
    "company": "Français",
    "id": "20c8975d343ceecbf616b6c86a662701",
    "venue_id": "836691",
    "speakers": "Benoît Giraudou"
  },
  {
    "event_key": "37",
    "active": "Y",
    "name": "Fun with functions",
    "event_start": "2019-01-25 10:00:00",
    "event_end": "2019-01-25 10:45:00",
    "event_type": "Language & Paradigms",
    "event_subtype": "Conference",
    "description": "Quand on parle de <strong>programmation fonctionnelle</strong> tout le monde pense <em>monade</em>. Venez découvrir un talk on où ne parle pas de monade mais de <strong>fonctions</strong>, ce qu’elles sont et de ce qu'on peut en faire.<br><br>Après un rapide tutoriel d'<strong>Haskell</strong> (c'est pas si compliqué que ça, vous verrez ;-)) on attaquera le vif du sujet avec un live coding d'un mini framework de test<br><br><strong><em><u>Présentation :</u></em></strong> <a href=\"https://t.co/0mOWqcL82T\" rel=\"noopener noreferrer\" target=\"_blank\">https://t.co/0mOWqcL82T</a><br><em><u><strong>Démo :</strong></u></em> <a href=\"https://repl.it/@EmmanuelLongeau/FunWithFunctions\" rel=\"noopener noreferrer\" target=\"_blank\">https://repl.it/@EmmanuelLongeau/FunWithFunction</a>s",
    "seats": "0",
    "goers": "17",
    "invite_only": "N",
    "venue": "Chrome 1",
    "company": "Français",
    "id": "20ded932f80b65cb07ca910fab032338",
    "venue_id": "836691",
    "speakers": "Emmanuel Longeau"
  },
  {
    "event_key": "21",
    "active": "Y",
    "name": "Machine learning with Spark : the road to production",
    "event_start": "2019-01-25 11:00:00",
    "event_end": "2019-01-25 11:45:00",
    "event_type": "I.A. & Deep/Machine Learning",
    "event_subtype": "Conference",
    "description": "We will present a case study for the industrialization of a machine learning project with Apache Spark. <br /> Starting from a prototype developed by a Data Scientist we will explore the unit testing problem and how BDD testing can help to build a easy to understand testing scenario. <br /> <br /> We will then have a look at the scheduling and dependency problem and a possible solution with Azkaban. <br /> To conclude we will talk about packaging, deployment and monitoring presenting the current solution used at Kelkoo Group.<br /> <br /> We want to share our experience on best practices and tips when putting machine learning into production while using good coding and testing practices.",
    "seats": "0",
    "goers": "15",
    "invite_only": "N",
    "venue": "Chrome 2 + 3 + 4",
    "company": "Français",
    "id": "224ac573726ed0922b40531ae1754136",
    "venue_id": "836698",
    "speakers": "Andrea Baita, André Bois-Crettez"
  },
  {
    "event_key": "14",
    "active": "Y",
    "name": "Design_databases_API(Rest || GraphQL || gRPC)",
    "event_start": "2019-01-25 16:00:00",
    "event_end": "2019-01-25 16:45:00",
    "event_type": "Web",
    "event_subtype": "Conference",
    "description": "Il existe une grande variété de patterns pour accéder à vos bases de données en fonction des cas d’usage et des technologies utilisées : simple CRUD, streaming, asynchrone, réactif, fonctions…<br /> <br /> Chez DataStax, au travers de l'implémentation d'application de references comme [Killrvideo](killrvideo.github.io) nous avons eu l’opportunité de tester la meme API en REST, gRPC et GraphQL avec Java (SpringBoot 2). Je vous propose un tour d’horizon des 3 solutions, les points forts, les points faibles, les details d’implementation au travers d'une demo et code reviews.",
    "seats": "0",
    "goers": "35",
    "invite_only": "N",
    "venue": "Chrome 2 + 3 + 4",
    "company": "Français",
    "id": "31d660e6131d68c5abe5655599cce076",
    "venue_id": "836698",
    "speakers": "Cedrick Lunven"
  },
  {
    "event_key": "32",
    "active": "Y",
    "name": "An Introduction to WebAssembly",
    "event_start": "2019-01-25 11:00:00",
    "event_end": "2019-01-25 11:45:00",
    "event_type": "Web",
    "event_subtype": "Conference",
    "description": "Want to write a web application? Better get familiar with JavaScript! JavaScript has long been the king of front-end. While there have been various attempts to dethrone it, they have typically involved treating JavaScript as an assembly-language analog that you transpile your code to. This has lead to complex build pipelines that result in JavaScript which the browser has to parse and you still have to debug. But what if there were an actual byte-code language you could compile your non-JavaScript code to instead? That is what WebAssembly is.<br /> <br /> I'm going to explain how WebAssembly works and how to use it in this talk. I'll cover what it is, how it fits into your application, and how to build and use your own WebAssembly modules. And, I'll demo how to build and use those modules with both Rust and the WebAssembly Text Format. That's right, I'll be live coding in an assembly language. I'll also go over some online resources for other languages and tools that make use of WebAssembly.<br /> <br /> When we're done, you'll have the footing you need to start building applications featuring WebAssembly. So grab a non-JavaScript language, a modern browser, and let's and get started!",
    "seats": "0",
    "goers": "37",
    "invite_only": "N",
    "venue": "Titane 2",
    "company": "English",
    "id": "330efa0ac10b4aae28f34f4beba3f7c7",
    "venue_id": "836688",
    "speakers": "Guy Royse"
  },
  {
    "event_key": "8",
    "active": "Y",
    "name": "Des microservices aux migroservices",
    "event_start": "2019-01-24 10:45:00",
    "event_end": "2019-01-24 11:30:00",
    "event_type": "Architecture",
    "event_subtype": "Conference",
    "description": "Ca y est, vous avez enfin la possibilité de démarrer un nouveau projet ou de migrer un de vos anciens monolithes et vous décidez de partir en architecture microservices ! <br /> On se répartit les services, on sort nos plus belles technos et c'est parti ! Au pire, vu qu'on va faire un microservice on pourra le remplacer plus tard facilement :grinning:. <br /> <br /> Plus on avance dans votre service, plus les soucis commencent à apparaitre : <br /> - Couplage avec d'autres services<br /> - Partages de données<br /> - Difficulté à étre déployés/opérés<br /> - Ownership des services<br /> - ...<br /> <br /> Notre microservice vient d'évoluer en migroservice ! :disappointed: <br /> On s'est trompé dans la recette et ajouté une bonne grosse de monolithe à note microservice ...<br /> <br /> Essayons de voir comment nous en sommes arrivés là, les pièges a éviter et si ce n'est pas, finalement, qu'une étape vers une architecture microservice.",
    "seats": "0",
    "goers": "82",
    "invite_only": "N",
    "venue": "Amphi",
    "company": "Français",
    "id": "40ebf62cf55868c803515e273869cdf6",
    "venue_id": "836673",
    "speakers": "Francois Teychene"
  },
  {
    "event_key": "43",
    "active": "Y",
    "name": "Blockchain at heart: how it works outside of the cryptocurrency trend?",
    "event_start": "2019-01-25 14:00:00",
    "event_end": "2019-01-25 14:45:00",
    "event_type": "Discover",
    "event_subtype": "Conference",
    "description": "Let&rsquo;s stop thinking the blockchain as a support for cryptocurrency, and let&rsquo;s deep dive in its technical aspect! How does the blockchain work, but code, demos, and magic!<br />Did you ever try to work with a blockchain? This not-so-new technology, sometimes described as &ldquo;the most important technology since the Internet&rdquo; struggle to find its use-cases outside of the cryptocurrency market. Let&rsquo;s take a look at how it works in-depth using a convincing use-case: a health notebook application. Based on a distributed blockchain, we&rsquo;ll see how to implement it to learn how to use its powerful features.<br />---<br />Slides online here: https://talks.m4dz.net/blockchain-at-heart/fr/",
    "seats": "0",
    "goers": "47",
    "invite_only": "N",
    "venue": "Amphi",
    "company": "Français",
    "id": "44a402c995bb3140cb36af25d8274da1",
    "venue_id": "836673",
    "speakers": "m4dz"
  },
  {
    "event_key": "18",
    "active": "Y",
    "name": "Service mesh patterns",
    "event_start": "2019-01-23 14:00:00",
    "event_end": "2019-01-23 17:00:00",
    "event_type": "DevOps / Cloud / Container & Scaling",
    "event_subtype": "University",
    "description": "This workshop discusses and explains the most popular patterns you can use with an Istio service mesh running on Kubernetes. It explains and demonstrates the use of traffic management with intelligent routing and load balancing, policy enforcement on the interaction between services in the service mesh, handling failures, and increasing the reliability of your services and your services’ telemetry and reporting.<br><br><strong><em><u>Pre-requisites:</u></em></strong> All materials required to be installed <u><em>before</em></u> the workshop is described on <a href=\"https://github.com/peterj/snowcamp\" rel=\"noopener noreferrer\" target=\"_blank\">https://github.com/peterj/snowcamp</a>",
    "seats": "0",
    "goers": "11",
    "invite_only": "N",
    "venue": "Chrome 4",
    "company": "English",
    "id": "492c54c90d6d3ceeae087b3359dabfb2",
    "venue_id": "836697",
    "speakers": "Sherwood Zern, Peter Jausovec"
  },
  {
    "event_key": "27",
    "active": "Y",
    "name": "Contrôler le partitionnement et le cache pour optimiser les performances dans Spark",
    "event_start": "2019-01-25 14:00:00",
    "event_end": "2019-01-25 14:45:00",
    "event_type": "Data",
    "event_subtype": "Conference",
    "description": "Pour exploiter au maximum le calcul distribué dans Spark, il est nécessaire de contrôler le nombre de tasks dans vos jobs pour s'assurer que tous les executors Spark travaillent en continu.<br /> <br /> Il faut également s'assurer que les données soient bien distribuées afin que la charge de travail soit équitablement partagée entre tous les executors Spark.<br /> <br /> Enfin, savoir quand il est pertinent d'activer le cache permet d'optimiser de façon significative vos applications Spark.<br /> <br /> Dans cette présentation, nous allons aborder tous les points ci-dessus, et montrer comment régler ces problèmes en partitionnant de manière pertinente les datasets et en adoptant une stratégie de cache adaptée.<br /> <br /> Nous allons apprendre, au travers d’exemples concrets :<br /> <br /> * ce qu'est une partition, comment le nombre de partitions dans un dataset est déterminé<br /> * comment modifier le nombre de partitions pour avoir de meilleures performances<br /> * quels sont les principaux niveaux de stockage du cache dans Spark<br /> * à évaluer les surcoûts liés à l'utilisation du cache<br /> * quand vous devez mettre un dataset en cache (et quand vous ne devriez pas)",
    "seats": "0",
    "goers": "4",
    "invite_only": "N",
    "venue": "Chrome 2 + 3 + 4",
    "company": "Français",
    "id": "4a9706ea5a90c4305dfbd6b5e0f329e0",
    "venue_id": "836698",
    "speakers": "Florian Fauvarque, Christophe Préaud"
  },
  {
    "event_key": "49",
    "active": "Y",
    "name": "Développez avec une boucle de retour rapide sur votre cluster Kubernetes",
    "event_start": "2019-01-24 16:00:00",
    "event_end": "2019-01-24 16:45:00",
    "event_type": "Language & Paradigms",
    "event_subtype": "Conference",
    "description": "Développer sur un cluster Kubernetes va devenir la norme dans un futur assez proche. Mais il est impératif que les développeurs puissent avoir la même expérience qu'auparavant. Nous verrons à l'aide d'exemples concrets quels sont les outils qui permettent d'obtenir une boucle de développement rapide et quel est le support de ces outils selon les IDEs.",
    "seats": "0",
    "goers": "28",
    "invite_only": "N",
    "venue": "Chrome 2 + 3 + 4",
    "company": "Français",
    "id": "50f8758b818239863b006c5c2f6f9d05",
    "venue_id": "836698",
    "speakers": "Jeff MAURY"
  },
  {
    "event_key": "40",
    "active": "Y",
    "name": "Il ne faut pas vendre la peau de YARN parce qu'un Mesos vaut mieux que deux Kubernetes",
    "event_start": "2019-01-24 10:45:00",
    "event_end": "2019-01-24 11:30:00",
    "event_type": "DevOps / Cloud / Container & Scaling",
    "event_subtype": "Conference",
    "description": "Bien que ces technologies permettent d'utiliser des conteneurs pour déployer, gérer et mettre à l'échelle des applications dans un cluster, elles résolvent en réalité des problèmes bien différents et sont ancrées dans des contextes très divers. En fait, aucun de ces outils largement adoptés n'est complètement comme les autres.<br /> <br /> Plutôt que de [simplement] comparer les caractéristiques et les fonctionnalités qui se chevauchent de ces technologies en évolution rapide, revoyons la mission initiale de chaque projet, son architecture et la manière dont ces solutions peuvent se compléter et interagir les unes avec les autres.<br /> <br /> On parlera d'ordonnancement et d'orchestration de conteneurs (avec Docker bien évidemment), d'allocation dynamique de ressources, et d'autres traits caractéristiques des gestionnaires de clusters. On évoquera également des _schedulers_ moins connus comme Nomad d'Hashicorp. Et nous nous risquerons à imaginer, pourquoi pas, notre solution idéale: hautement disponible, distribuée, capable de prendre en charge des services conteneurisés, virtualisés, _legacy_, de courte et longue durée... <br /> <br /> Ce Talk aborde des concepts d'informatique distribuée complexes. Pour cette raison, le niveau de ce Talk est fixé à \"Intermédiaire\". <br /> Il est aussi l'occasion de tenir un discours \"engagé\" et de nous rappeler à nous-mêmes, acteurs du monde numérique, consultants et salariés des ESN, que nous avons un devoir de conseil et que nous devons accompagner nos clients dans leurs choix techniques. Il faut pour cela nous informer sans cesse par de la veille technologique, comparer des solutions et en dresser un état de l'art, ne pas [tout de suite] céder à la hype des dernières technologies et développer un esprit critique. <br /> <br /> À mon sens, il s'agit de rappeler ici la mission principale de l'architecte: être capable d'évaluer objectivement une ou plusieurs solutions selon des critères de coûts, fonctionnels et techniques.",
    "seats": "0",
    "goers": "26",
    "invite_only": "N",
    "venue": "Titane 2",
    "company": "Français",
    "id": "52253a9ba3ff88d8da6a7c7b291fc219",
    "venue_id": "836688",
    "speakers": "Pascal Gillet"
  },
  {
    "event_key": "41",
    "active": "Y",
    "name": "Quel workflow GIT choisir?",
    "event_start": "2019-01-25 16:00:00",
    "event_end": "2019-01-25 16:45:00",
    "event_type": "Method",
    "event_subtype": "Conference",
    "description": "A chaque projet ses challenges, à chaque équipe ses besoins particuliers, à chaque entreprises ses règles. Doit-on faire tous pareils, ou a-t-on le droit d’être différent ?<br /> <br /> Dans un premier temps je vous présenterai les principaux workflows existants, même ceux issus de nos ancêtres CVS et SVN en vous en donnant à chaque fois les principaux avantages et inconvénients,<br /> <br /> Nous prendrons ensuite un peu de temps pour les comparer selon une liste de critères,<br /> <br /> et finalement, je vous présenterai sous la forme d'une matrice de décision mon retour d'expérience.<br /> <br /> <br /> Bénéfices pour le participant : <br /> Le participant pourra repartir avec la matrice de décision, qui se base sur des cas concrets pour choisir le \"bon\" workflow.<br /> <br /> Parmi les critères étudiés, on pourra citer :<br /> <br /> Le contexte métier :<br /> - open source<br /> - entreprise<br /> - mondes normés (médical, finance, ...)<br /> <br /> La topologie des projets :<br /> - POC<br /> - Legacy<br /> - Cloud<br /> - Multinenant<br /> <br /> Les contraintes du projet :<br /> - Multi versioning<br /> - Fréquence de livraison<br /> - Stabilité, hotfixes<br /> <br /> L’équipe :<br /> - La taille de l’équipe<br /> - Le niveau de l’équipe<br /> - Les processes de l’équipe (reviews, tests, CI, validation)<br /> <br /> La complexité de mise en œuvre et de maintenance de chaque workflow<br />",
    "seats": "0",
    "goers": "29",
    "invite_only": "N",
    "venue": "Chrome 1",
    "company": "Français",
    "id": "5252acb2adba29253db602e86b05202d",
    "venue_id": "836691",
    "speakers": "Hadrien Thomas"
  },
  {
    "event_key": "58",
    "active": "Y",
    "name": "Welcome",
    "event_start": "2019-01-23 09:00:00",
    "event_end": "2019-01-23 09:30:00",
    "seats": "0",
    "goers": "15",
    "invite_only": "N",
    "venue": "Hall Sponsors",
    "id": "5c47bfbc46da01eecf675fb32d833efb",
    "venue_id": "836676"
  },
  {
    "event_key": "38",
    "active": "Y",
    "name": "Fast and Beautiful: Modern Image Delivery Techniques",
    "event_start": "2019-01-24 10:45:00",
    "event_end": "2019-01-24 11:30:00",
    "event_type": "Web",
    "event_subtype": "Conference",
    "description": "The average mobile website page weight is ~50% images. Toss in the complication of thousands of differently sized screens, and it might appear that efficient delivery of images to every device is an impossible task. But all is not lost! In this talk, we’ll examine strategies to send the perfect image to every device, ensuring a fast, beautiful rendering of your content. We’ll look at progressive images, placeholder images, lazy loading and other techniques and real world examples that will improve the usability of your site or app. Attendees will come away with an understand of the current ‘state of the art’ for optimizing visual content on the web.",
    "seats": "0",
    "goers": "13",
    "invite_only": "N",
    "venue": "Chrome 2 + 3 + 4",
    "company": "English",
    "id": "62edcdc6a59442356919d4f6a80f5904",
    "venue_id": "836698",
    "speakers": "Doug Sillars"
  },
  {
    "event_key": "60",
    "active": "Y",
    "name": "Welcome / Breakfast",
    "event_start": "2019-01-25 08:00:00",
    "event_end": "2019-01-25 08:45:00",
    "seats": "0",
    "goers": "70",
    "invite_only": "N",
    "venue": "Hall Sponsors",
    "id": "6a0bfd85a51e9dee73f83c8564171e8a",
    "venue_id": "836676"
  },
  {
    "event_key": "23",
    "active": "Y",
    "name": "Architecture Decision Records : enfin une documentation qui vous ressemble !",
    "event_start": "2019-01-25 11:00:00",
    "event_end": "2019-01-25 11:45:00",
    "event_type": "Method",
    "event_subtype": "Conference",
    "description": "En tant que développeur, on n'aime pas écrire de la documentation, c'est un fait. Pourtant il y a sans doute quelque chose que l'on aime encore moins : regarder la base de code et se demander pourquoi il a été organisé comme ça, pourquoi le choix de tel ou tel framework, etc.<br /> <br /> C'est d'autant plus vrai dans un contexte agile et depuis l'adoption des microservices qui demandent d'être capable d'évoluer rapidement. Mais alors comment faire pour garder le contexte du projet sans se prendre la tête ?<br /> <br /> A travers cette présentation nous verrons comment les Architecture Decision Records (ADRs) peuvent nous aider à créer un historique immutable des choix d'architecture à travers l'écriture de documents très simples. Après 1 an d'expérimentation dans mon équipe, nous sommes plus que satisfaits de l'utilisation des ADRs.<br /> <br /> A ce jour c'est probablement la seule \"documentation\" que j'ai réussi à maintenir à jour et que je n'ai pas peur de consulter de peur qu'elle soit obsolète.<br /> Cette présentation sera faite sous la forme d'un ADR, ce qui nous permettra de voir comment ils sont construits.",
    "seats": "0",
    "goers": "43",
    "invite_only": "N",
    "venue": "Chrome 1",
    "company": "Français",
    "id": "6a4132685187f4f02858a0fb02ef0707",
    "venue_id": "836691",
    "speakers": "Olivier Revial"
  },
  {
    "event_key": "22",
    "active": "Y",
    "name": "A la découverte d’Ansible",
    "event_start": "2019-01-23 09:30:00",
    "event_end": "2019-01-23 12:30:00",
    "event_type": "DevOps / Cloud / Container & Scaling",
    "event_subtype": "University",
    "description": "Ce workshop, se fera sur des instances ec2:<br><br>* une instance avec Ansible<br>* quelques instances qui seront manipulées via l'instance Ansible.<br><br>Du coup, pour pouvoir faire ce workshop, il faut que les personnes:<br><br>* aient un client ssh pour pouvoir se connecter aux instances ec2 pour faire les manipulations.<br>* soient à l'aise pour modifier des fichiers textes (yaml) à travers une console ssh (par exemple avec vim) ou avoir un éditeur texte capable de gérer les modification à travers du ssh<br><br>Il est aussi préférable d'avoir une connaissance de la syntaxte yaml.<br>Le but du workshop sera de vous guider à travers des exercices pour vous amener à comprendre les différents concepts Ansible comme :<br><br>* les inventaires: les groupes, les variables de groupes, de hosts<br>* les playbook: les tasks, les modules, les roles, ...<br><br>Au final, l'idée est que vous ayez écrit un playbook qui vous permet de déployer une \"pseudo\" application web<br><br><strong><em>Pré-requis :</em></strong> les participants doivent avoir un client <em><strong>ssh opérationnel</strong></em> et sont invités à installer au préalable <strong><em>Atom</em></strong> (<a href=\"https://atom.io/\" rel=\"noopener noreferrer\" target=\"_blank\">https://atom.io/</a>)",
    "seats": "0",
    "goers": "5",
    "invite_only": "N",
    "venue": "Chrome 2",
    "company": "Français",
    "id": "6a7edb6433cd6c9d236a9acaf5dc2e5c",
    "venue_id": "836692",
    "speakers": "Olivier Perriot, Stéphane Perez"
  },
  {
    "event_key": "53",
    "active": "Y",
    "name": "Face à l'épidémie de d'obésiciel, il est temps de concevoir des services numérique plus responsables !",
    "event_start": "2019-01-25 08:45:00",
    "event_end": "2019-01-25 09:45:00",
    "event_subtype": "Keynote",
    "description": "Abstract : En 1969, la Nasa a envoyé des hommes sur la Lune avec un simple e-mail. 50 ans plus tard, une épidémie d'obésité touche toutes les couches de la galaxie logicielle. Le coût environnemental et économique du gras numérique est colossal. Mais plus grave encore, il entraîne l'infarctus de nombre de startup et grandes entreprises. Il est donc urgent de trouver un remède. Heureusement, c'est ce que propose une bande de Jedi du numérique responsable regroupés au sein du Collectif conception numérique responsable. Découvrez cette autre facette de la force, et rejoignez-nous pour construire un avenir numérique plus enviable pour nos enfants !",
    "seats": "0",
    "goers": "88",
    "invite_only": "N",
    "venue": "Amphi",
    "id": "6b6e36e2c417823c42c30ede3db60de1",
    "venue_id": "836673",
    "speakers": "Frédéric Bordage"
  },
  {
    "event_key": "3",
    "active": "Y",
    "name": "La révolution dans vos apps, c'est la gestion de l'état!",
    "event_start": "2019-01-24 16:00:00",
    "event_end": "2019-01-24 16:45:00",
    "event_type": "Web",
    "event_subtype": "Conference",
    "description": "Angular, React, Vue… Le choix du framework, ce n'est pas le plus important aujourd'hui!<br /> <br /> Le coeur du problème n'est plus comment faire des composants web et quelle est la meilleure manière de le faire, mais plutôt comment gérer leur état.<br /> Découvrez les grands principes derrière la gestion d'état centralisé, ses bénéfices sur les performances, la maintenance et le débuggage de vos apps.<br /> <br /> Après un peu de théorie, nous verrons à travers des examples de code les différences que cela implique dans une application… quelque soit le framework utilisé!",
    "seats": "0",
    "goers": "46",
    "invite_only": "N",
    "venue": "Amphi",
    "company": "Français",
    "id": "6c9b3dfde864c961f72feae120c5290d",
    "venue_id": "836673",
    "speakers": "Yohan Lasorsa"
  },
  {
    "event_key": "48",
    "active": "Y",
    "name": "(Quick kata to) explain DIP from SOLID principles",
    "event_start": "2019-01-24 15:00:00",
    "event_end": "2019-01-24 15:45:00",
    "event_type": "Method",
    "event_subtype": "Conference",
    "description": "My company decided to train *young* graduates on everything they will ever work on as professionals.<br /> As we deliver Masterclasses in Clean code for our colleagues (aka *old* graduates), we were asked to train the *young* ones as well.<br /> Having planned a day for all the SOLID principles, we couldn't give them a 90 min kata to train (as we usually do)<br /> We wanted to take 1 hour per principle ( theory, example, exercise and correction of the exercise included",
    "seats": "0",
    "goers": "34",
    "invite_only": "N",
    "venue": "Chrome 1",
    "company": "Français",
    "id": "6d4a0005246be5c4e73a3af4b463f768",
    "venue_id": "836691",
    "speakers": "Michelle Avomo"
  },
  {
    "event_key": "30",
    "active": "Y",
    "name": "Is Quantum Computing Really a Thing?",
    "event_start": "2019-01-25 10:00:00",
    "event_end": "2019-01-25 10:45:00",
    "event_type": "Discover",
    "event_subtype": "Conference",
    "description": "Quantum computing has existed as a theoretical concept for some time. I recently saw some talks on quantum computing and I've been inspired to start researching the field myself. There are now a handful of (known) quantum computers in existence, some of which, such as the \"IBM Q Experience\" allow you to execute real quantum programs. I'll give an overview of the state of the art, what the potential of quantum computing is, what its limitations might be and a small dose of speculation on what applications could be suited to to quantum computers and when they might start to be really useful.<br /> <br /> This is an evolution of the talk I've given a couple of times now. The first time at Devoxx Poland in June 2018. Throughout 2018 I went to loads of meetings, loads of lectures and in October I hosted a Quantum Hack Day at ThoughtWorks in which we had priority use of IBM's Q Computer. This talk is a description of how I got involved in quantum computers and where the journey took me.<br /> <br /> I've also designed a demonstration of Quantum Computing, using Microsoft's Q# (not a real quantum computer, it is a simulator designed to run on a traditional digital computer) called \"Clementine's Cat\". I was inspired to make Clementine's Cat when I described Shrodinger's Cat to my daughter and she was horified that anybody would do such a thing to their cat. So Clementine's Cat is a humane modern spin on the traditional quantum thought experiment in which no cats are harmed, either theoretically or in reality.",
    "seats": "0",
    "goers": "32",
    "invite_only": "N",
    "venue": "Amphi",
    "company": "English",
    "id": "6ecc7df4dfac86949ccc6c61a8ea68cf",
    "venue_id": "836673",
    "speakers": "James Birnie"
  },
  {
    "event_key": "24",
    "active": "Y",
    "name": "Comment perdre sa surcharge featurale ?",
    "event_start": "2019-01-25 15:00:00",
    "event_end": "2019-01-25 15:45:00",
    "event_type": "Method",
    "event_subtype": "Conference",
    "description": "Le cycle de vie d'une application est un chemin n&eacute;buleux et plein de dangers. La complexit&eacute; ne fait que croitre durant les mois et les ann&eacute;es d'utilisation. L'un des plus gros challenges d'un d&eacute;veloppeur est de pouvoir la contr&ocirc;ler tout en ajoutant de nouvelles fonctionnalit&eacute;s (features). Des solutions existent : le r&eacute;-&eacute;criture de code ou encore la maitrise de la dette technique. En effet, ces deux actions permettent de lever \"la complexit&eacute; accidentelle\". Mais que faisons nous de la \"complexit&eacute; essentielle\" ? La complexit&eacute; qui n'est pas li&eacute;e au code. La seule solution : Supprimer des fonctionnalit&eacute;s ! Ce talk vous expliquera comment perdre la surcharge featurale de vos applications en comprenant la diff&eacute;rence entre la complexit&eacute; essentielle et la complexit&eacute; accidentelle, mais aussi en vous donnant des cl&eacute;s pour mener &agrave; bien ce changement de vie dans vos &eacute;quipes projet.<br /><u><strong><em>Pr&eacute;sentation :</em></strong></u> <a href=\"https://t.co/kcEPhXpcUv\" target=\"_blank\">https://t.co/kcEPhXpcUv</a>",
    "seats": "0",
    "goers": "39",
    "invite_only": "N",
    "venue": "Chrome 2 + 3 + 4",
    "company": "Français",
    "id": "7191c6681bd13eb07e37e4d4e5e5fd37",
    "venue_id": "836698",
    "speakers": "Estelle Landry"
  },
  {
    "event_key": "45",
    "active": "Y",
    "name": "Découvrez pourquoi Elixir est votre prochain langage!",
    "event_start": "2019-01-23 09:30:00",
    "event_end": "2019-01-23 12:30:00",
    "event_type": "Language & Paradigms",
    "event_subtype": "University",
    "description": "Elixir est un langage fantastique, construit par des crafters avec le test comme axe central<br /> <br /> Elixir est construit sur Erlang, la seule VM avec une disponibilité de 99,999999999% [ref](https://pragprog.com/articles/erlang)<br /> <br /> Elixir est à Erlang, ce que Kotlin est a Java<br /> Viens découvrir! <br /> <br /> Je vous propose un workshop pour découvrir Elixir,<br /> <br /> J'ai envie de vous faire découvrir Elixir a travers un Clone de Slack.<br /> <br /> On jouera aussi avec StimulusJS pour rendre tout ca dynamique et pas faire un front en React ou en Vue ou en Angular (c'est tellement dépassé...).<br /> <br /> les pré-requis au workshop sont la :<br /> <br /> https://github.com/savoisn/elixir-workshop<br /> <br />",
    "seats": "0",
    "goers": "3",
    "invite_only": "N",
    "venue": "Chrome 3",
    "company": "Français",
    "id": "76a0ca975273e11ee6952f99d0e75b49",
    "venue_id": "836695",
    "speakers": "Nicolas Savois"
  },
  {
    "event_key": "11",
    "active": "Y",
    "name": "Comment déployer des modèles de deep learning en production avec TensorFlow Serving ?",
    "event_start": "2019-01-25 16:00:00",
    "event_end": "2019-01-25 16:45:00",
    "event_type": "I.A. & Deep/Machine Learning",
    "event_subtype": "Conference",
    "description": "Récemment, les chercheurs académiques et industriels ont conduit de nombreux travaux dans le domaine du deep learning amenant à la conception de nouveaux modèles très puissants. Malgré ce flux constant de résultats, beaucoup de ces travaux restent à l’état de recherche, et il est souvent difficile d’utiliser ces nouveaux modèles en production.<br /> <br /> Ce talk (en français) a pour but de présenter une solution à cette problématique : TensorFlow Serving. Après avoir illustré la problématique ciblée à travers différents exemples, cette librairie et la manière dont elle répond aux problèmes cités seront présentées. Ensuite, il sera montré, sous forme de tutoriel pratique, comment déployer un modèle pré-entraîné de détection d’objets à l’aide de TensorFlow Serving.<br />",
    "seats": "0",
    "goers": "14",
    "invite_only": "N",
    "venue": "Titane 2",
    "company": "Français",
    "id": "77f03693a0711a3eb90f92b3d34d3dfe",
    "venue_id": "836688",
    "speakers": "Sébastien Pelurson"
  },
  {
    "event_key": "28",
    "active": "Y",
    "name": "Zero-downtime deployment with Kubernetes, Spring Boot and Flyway",
    "event_start": "2019-01-24 15:00:00",
    "event_end": "2019-01-24 15:45:00",
    "event_type": "Language & Paradigms",
    "event_subtype": "Conference",
    "description": "Kubernetes allows a lot. After discovering its features, it’s easy to think it can magically transform your application deployment process into a painless no-event. For Hello World applications, that is the case. Unfortunately, not many of us do deploy such applications day-to-day.<br><br>You need to think about application backward compatibility, possible rollback, database schema migration, etc. I believe the later is one of the biggest pain point. In this talk, I’ll demo how to update a Spring Boot app deployed on a Kubernetes cluster with a non-trivial database schema migration with the help of Flyway, while keeping the service up during the entire update process.<br><br>Présentation : <a href=\"https://docs.google.com/presentation/d/17UqkWkCgntJCVBzNPWkh1chGVzDwbY1kxQsFnq3l-YA/edit#slide=id.p\" rel=\"noopener noreferrer\" target=\"_blank\">https://docs.google.com/presentation/d/17UqkWkCgntJCVBzNPWkh1chGVzDwbY1kxQsFnq3l-YA/edit#slide=id.p</a>",
    "seats": "0",
    "goers": "42",
    "invite_only": "N",
    "venue": "Titane 2",
    "company": "Français",
    "id": "7ffd46cc680af814cdb4851c42d53bc0",
    "venue_id": "836688",
    "speakers": "Nicolas Fränkel"
  },
  {
    "event_key": "5",
    "active": "Y",
    "name": "Vanilla JS 2018",
    "event_start": "2019-01-25 10:00:00",
    "event_end": "2019-01-25 10:45:00",
    "event_type": "Web",
    "event_subtype": "Conference",
    "description": "On a tous vu une conf ou lu un article sur une nouvelle fonctionnalité des navigateurs mais ce n'est pas toujours évident de se faire une idée quant à la question : \"ok mais globalement, vers où on va ?\"<br /> <br /> J'ai donc lancé un projet bac à sable nommé Vanilla JS 2018. Il a des règles strictes (sinon on s'ennuie !) :<br /> - Interdiction totale de l'utilisation de code source externe au projet<br /> - ‎Volonté d'utiliser autant de nouvelles normes que possible. Quelque soit les univers : HTTP, HTML, DOM, JS, CSS.<br /> - ‎Tout est autorisé du moment que ce soit une norme non propriétaire et que cela fonctionne dans au moins 2 navigateurs (flags autorisés).<br /> <br /> Nous parlerons d'un bon nombre de sujets :<br /> - HTTP/2<br /> - Web Components<br /> - Virtual Dom<br /> - State Management<br /> - Web Workers<br /> - Service Workers<br /> <br /> Je vous propose de vous présenter les résultats d'un \"fun project\" qui, pour moi, a sûrement été le plus intéressant et enrichissant depuis longtemps si ce n'est depuis toujours.<br />",
    "seats": "0",
    "goers": "22",
    "invite_only": "N",
    "venue": "Titane 2",
    "company": "Français",
    "id": "802958099f8839a93ba545c545c9f21d",
    "venue_id": "836688",
    "speakers": "Matthieu Lux"
  },
  {
    "event_key": "12",
    "active": "Y",
    "name": "L'open-source à la rescousse de mes APIS: comment les sécuriser grâce à Gravitee.io et Keycloak",
    "event_start": "2019-01-24 14:00:00",
    "event_end": "2019-01-24 14:45:00",
    "event_type": "Security",
    "event_subtype": "Conference",
    "description": "Les concepts de CORS, OAuth, OpenID Connect, SAML, JWT rate-limiting, quota,... sont maintenant largement répandus mais pourtant mal maîtrisés et pas toujours mis en oeuvre dans les règles de l'art. Pour faciliter la vie du développeur, nous allons voir comment mettre en place la sécurisation de vos APIs sans avoir à intervenir sur vos backends grâce aux outils open-source que sont Gravitee.io et Keycloak.<br><br><strong><em><u>Présentation :</u></em></strong> ​<a href=\"https://t.co/zFJkMzg1BQ\" rel=\"noopener noreferrer\" target=\"_blank\">https://t.co/zFJkMzg1BQ</a>​​​",
    "seats": "0",
    "goers": "26",
    "invite_only": "N",
    "venue": "Chrome 1",
    "company": "Français",
    "id": "971eb47b65d75e0ca08b8fe7f39ab0b3",
    "venue_id": "836691",
    "speakers": "Guillaume Gillon, Brassely David"
  },
  {
    "event_key": "15",
    "active": "Y",
    "name": "Hashistack : orchestrer des applications Cloud Native avec simplicité",
    "event_start": "2019-01-24 16:00:00",
    "event_end": "2019-01-24 16:45:00",
    "event_type": "DevOps / Cloud / Container & Scaling",
    "event_subtype": "Conference",
    "description": "Lorsqu'on parle d'orchestration de conteneurs, d'ex&eacute;cution d'applications Cloud Native, tout le monde se tourne vers kubernetes. Et pourtant, d'autres solutions existent. L'une d'elle est particuli&egrave;rement efficace et se base sur une suite d'outils libres d&eacute;velopp&eacute;s par Hashicorp : Consul et Nomad en sont les briques principales.<br /> <br /> Voyons ensemble et en d&eacute;mos comment mettre en oeuvre une telle stack et pourquoi pas vous faire changer d'avis sur l'orchestration de vos applications.",
    "seats": "0",
    "goers": "25",
    "invite_only": "N",
    "venue": "Titane 2",
    "company": "Français",
    "id": "9972a0c346ec295cc5ccbf2d90bbeb31",
    "venue_id": "836688",
    "speakers": "Yves Brissaud"
  },
  {
    "event_key": "50",
    "active": "Y",
    "name": "Kubeflow : Tensorflow on Kubernetes",
    "event_start": "2019-01-25 14:00:00",
    "event_end": "2019-01-25 14:45:00",
    "event_type": "I.A. & Deep/Machine Learning",
    "event_subtype": "Conference",
    "description": "Créer un modèle de ML n'est que la partie visible de l'iceberg. Une fois le modèle créé, il reste à l'entrainer, des fois de façon distribuée, le mettre à disposition des utilisateurs et garantir son bon fonctionnement. Vous verrez durant ce talk les différentes étapes de création d'un modèle de ML.<br>L’intelligence artificielle est en train de révolutionner tous les domaines : médecine, pharmacie, automobile, même l’informatique en lui-même. Mais la multitude d’outils mis à disposition des développeurs rend la portabilité et l’entrainement de modèle compliqué, non répétable et non scalable. Durant ce talk, nous verrons comment déployer Kubeflow, un projet tirant partie de la puissance de Kubernetes afin d’entrainer des modèles de Machine Learning basé sur Tensorflow. Nous verrons aussi comment grâce aux GPU et Kubernetes, nous pouvons accélérer la phase d’apprentissage de chaque modèle. Enfin, nous verrons comment entrainer un modèle de machine learning simplement grâce à JupyterHub.",
    "seats": "0",
    "goers": "26",
    "invite_only": "N",
    "venue": "Titane 2",
    "company": "Français",
    "id": "9a6c22359b2727cce7e85588b170155a",
    "venue_id": "836688",
    "speakers": "Laurent Grangeau"
  },
  {
    "event_key": "42",
    "active": "Y",
    "name": "Una-Gitlab, le TP à Roulette !",
    "event_start": "2019-01-23 14:00:00",
    "event_end": "2019-01-23 17:00:00",
    "event_type": "DevOps / Cloud / Container & Scaling",
    "event_subtype": "University",
    "description": "A l&rsquo;image de Perceval et Karadock, Logan et Kevin reviennent d&rsquo;une qu&ecirc;te dans la contr&eacute;e de Gitlab et vont vous compter leurs aventures parsem&eacute;es de d&eacute;couvertes : Runners, YAML et m&ecirc;me de l&rsquo;int&eacute;gration continue ! L&rsquo;on esp&egrave;re que P&egrave;re Blaise r&eacute;ussira &agrave; prendre des notes&hellip;<br /><br />Lors de cette qu&ecirc;te, il a &eacute;t&eacute; n&eacute;cessaire de mettre en place une int&eacute;gration continue pour une arm&eacute;e de d&eacute;veloppeurs sanguinaires qui avaient plein de besoins tout bizarres&hellip; Et &agrave; la force de leur &eacute;p&eacute;e, de leur courage et pas du tout de l&rsquo;aide de Merlin (qui sait toujours rien faire&hellip;), Logan et Kevin mis &agrave; disposition une CI compl&egrave;te avec job, stage, int&eacute;gration avec des outils externes (PostgreSQL, Artifactory, Google Cloud Platform&hellip;) tout en la gardant simple et versionnable.<br /><br />L&rsquo;on pourra m&ecirc;me finir sur un exemple de mise en place de la CI dans le cloud (Google Cloud ou Clever, &agrave; voir en fonction des pr&eacute;f&eacute;rences et de l&rsquo;acc&egrave;s &agrave; des voucher).<br /><br /><em><strong>Notes des speakers</strong></em> : A partir de gitlab.com, nous mettrons en place une CI avec des runners custom install&eacute; sur les postes des participants. A partir de l&agrave;, nous pourrons jouer avec les diff&eacute;rents cas et fonctionnalit&eacute;s g&eacute;r&eacute;es par la CI de Gitlab (build multi-techno, CI, d&eacute;ploiement sur la plateforme cible&hellip;)<br /><br /><em><strong>Pr&eacute;-requis :&nbsp;</strong></em><br /> \r\n<ul>\r\n<li>git</li>\r\n<li>droit d'installation de logiciel tiers sur la machine (droits root ou similaire)</li>\r\n<li>&nbsp;docker</li>\r\n<li>&nbsp;un IDE/Editeur (de VIM &agrave; IntellliJ...)</li>\r\n</ul>\r\n<strong>Lien du tp</strong>:&nbsp;http://bit.ly/unagitlab-workshop",
    "seats": "0",
    "goers": "9",
    "invite_only": "N",
    "venue": "Chrome 2",
    "company": "Français",
    "id": "9e142909b948f0e36ccabbde6e9975f2",
    "venue_id": "836692",
    "speakers": "Kevin Davin, Logan Weber"
  },
  {
    "event_key": "10",
    "active": "Y",
    "name": "Building smarter apps with Machine Learning, from magic to reality",
    "event_start": "2019-01-24 14:00:00",
    "event_end": "2019-01-24 14:45:00",
    "event_type": "I.A. & Deep/Machine Learning",
    "event_subtype": "Conference",
    "description": "What about making your app smarter without any knowledge in AI? With pre-trained models and a few lines of code, Machine Learning APIs can analyze your data. Moreover, AutoML techniques can now help in getting even more specific insights tailored to your needs.<br /> <br /> In this session, you’ll see how to transform or extract information from text, image, audio & video with the latest ML APIs, how to train an AutoML custom model, and you’ll be an active player of a live demo. Don't put your smartphone in airplane mode!",
    "seats": "0",
    "goers": "39",
    "invite_only": "N",
    "venue": "Chrome 2 + 3 + 4",
    "company": "Français",
    "id": "a0d95974955f4370d9744761497eb482",
    "venue_id": "836698",
    "speakers": "Laurent Picard"
  },
  {
    "event_key": "52",
    "active": "Y",
    "name": "The Why Behind DevOps and Microservices",
    "event_start": "2019-01-24 09:20:00",
    "event_end": "2019-01-24 10:05:00",
    "event_subtype": "Keynote",
    "seats": "0",
    "goers": "93",
    "invite_only": "N",
    "venue": "Amphi",
    "company": "Français",
    "id": "a1f61482d448cabac9582d0fac0fb8bf",
    "venue_id": "836673",
    "speakers": "Edson Yanaga"
  },
  {
    "event_key": "55",
    "active": "Y",
    "name": "Lunch",
    "event_start": "2019-01-24 12:35:00",
    "event_end": "2019-01-24 14:00:00",
    "seats": "0",
    "goers": "72",
    "invite_only": "N",
    "venue": "Hall Sponsors",
    "id": "a37d8d3eb4dc4c7149753ad99c9ed4d3",
    "venue_id": "836676"
  },
  {
    "event_key": "56",
    "active": "Y",
    "name": "Lunch",
    "event_start": "2019-01-25 12:00:00",
    "event_end": "2019-01-25 13:40:00",
    "seats": "0",
    "goers": "66",
    "invite_only": "N",
    "venue": "Hall Sponsors",
    "id": "a409be514eba532b392ed41efce39cb0",
    "venue_id": "836676"
  },
  {
    "event_key": "34",
    "active": "Y",
    "name": "Clojure en production: ça donne quoi ?",
    "event_start": "2019-01-24 11:45:00",
    "event_end": "2019-01-24 12:30:00",
    "event_type": "Language & Paradigms",
    "event_subtype": "Conference",
    "description": "De notre object store &agrave; nos outils de stream processing, du frontend au backend, chez Exoscale Clojure est partout. Ce langage original pr&eacute;sente bien des avantages: programmation fonctionnelle, immutabilit&eacute;, REPL driven development&hellip; Vous voulez en savoir plus sur Clojure ? Ce talk est pour vous !<br /><br />Clojure est un langage de la famille des Lisp. Ce langage peu commun pr&eacute;sente un certain nombre d&rsquo;avantages:<br /><br /> \r\n<ul>\r\n<li>Le langage favorise la programmation fonctionnelle: en Clojure, les donn&eacute;es de notre programme sont repr&eacute;sent&eacute;es via des structures de donn&eacute;es immutables que l&rsquo;on peut facilement manipuler gr&acirc;ce &agrave; une librairie standard riche.</li>\r\n</ul>\r\n<ul>\r\n<li>Fonctionnant sur la machine virtuelle Java, tout l&rsquo;&eacute;cosyst&egrave;me Java est accessible depuis Clojure.</li>\r\n</ul>\r\n<ul>\r\n<li>Clojure fournit de nombreux outils pour &eacute;crire du code concurrent et parall&egrave;le de mani&egrave;re efficace et sans risque.</li>\r\n</ul>\r\n<ul>\r\n<li>Lorsque l&rsquo;on code en Clojure, notre code est en permanence connect&eacute; au REPL (un interpr&eacute;teur avec un certain nombre de fonctionnalit&eacute;s). Cela permet au d&eacute;veloppeur d&rsquo;avoir un feedback tr&egrave;s rapide sur son code et facilite l&rsquo;exploration de solutions via le REPL.</li>\r\n</ul>\r\n<ul>\r\n<li>Une syntaxe simple, concise et coh&eacute;rente, b&eacute;n&eacute;ficiant d&rsquo;un syst&egrave;me de macro tr&egrave;s int&eacute;ressant.</li>\r\n</ul>\r\n<ul>\r\n<li>ClojureScript permet de coder nos frontend en Clojure, et de partager du code et des librairies entre le frontend et le backend (lui tournant sur la JVM).</li>\r\n</ul>\r\n<br /> Chez Exoscale, nous utilisons Clojure &agrave; quasiment tous les niveaux de notre stack technique: applications web, outils de stream processing et de monitoring, pour notre infrastructure Cloud interne (en particulier notre object store) et depuis peu pour nos applications frontend.<br />Dans ce talk, je pr&eacute;senterais Clojure, sa syntaxe et sa philosophie, en mettant l&rsquo;accent sur ce que Clojure apporte aux d&eacute;veloppeurs au quotidien. Pour cela, je m&rsquo;appuierais de l&rsquo;exp&eacute;rience que nous avons de Clojure chez Exoscale.<br /><br />Je ferais &eacute;galement une rapide d&eacute;mo de mon workflow de d&eacute;veloppement et des avantages qu&rsquo;apportent le REPL.",
    "seats": "0",
    "goers": "18",
    "invite_only": "N",
    "venue": "Chrome 2 + 3 + 4",
    "company": "Français",
    "id": "a5bbf682d0693f6f9d8e0fbb5167f3f3",
    "venue_id": "836698",
    "speakers": "Mathieu Corbin"
  },
  {
    "event_key": "61",
    "active": "Y",
    "name": "Le mot de la fin",
    "event_start": "2019-01-25 16:50:00",
    "event_end": "2019-01-25 17:20:00",
    "seats": "0",
    "goers": "72",
    "invite_only": "N",
    "venue": "Hall Sponsors",
    "id": "a994f169e9a7ae43bd69bd211f6cc067",
    "venue_id": "836676"
  },
  {
    "event_key": "36",
    "active": "Y",
    "name": "Automatisation et DevOps, yes we can !",
    "event_start": "2019-01-25 16:00:00",
    "event_end": "2019-01-25 16:45:00",
    "event_type": "DevOps / Cloud / Container & Scaling",
    "event_subtype": "Conference",
    "description": "Chez KelkooGroup nous croyons à l'automatisation. Dans cette présentation nous montrerons comment nous nous sommes appuyés sur des outils comme Ansible, GitLab, Jenkins pour mettre en place un framework d'automatisation DevOps.<br /> <br /> Clic... la VM est prête. Clic... le code en développement est déployé sur un serveur où il peut être testé. Clic... la release est prête. Clic... la release est déployée en production. Clic... on fait un roll-back : NON !! le roll-back ça n'arrive jamais ;-)<br /> <br /> Résultat : les Dev et les Ops perdent moins de temps sur des tâches répétitives, les PO ont leurs features disponibles plus rapidement en production, les Ops ont moins d'incidents de production, tout le monde est content :-)<br /> <br /> _Yes we can!_<br /> <br /> Venez partager notre expérience, assister à notre démo, et repartez aussi avec des rêves plein la tête...",
    "seats": "0",
    "goers": "34",
    "invite_only": "N",
    "venue": "Amphi",
    "company": "Français",
    "id": "b13cbcd72236184f28f2d9559e16e04b",
    "venue_id": "836673",
    "speakers": "Olivier Perriot, Amélie Deltour"
  },
  {
    "event_key": "39",
    "active": "Y",
    "name": "Avoir un train à l'heure, c'est Kafkaïen !!",
    "event_start": "2019-01-25 10:00:00",
    "event_end": "2019-01-25 10:45:00",
    "event_type": "Data",
    "event_subtype": "Conference",
    "description": "Tout le monde conna&icirc;t la ponctualit&eacute; l&eacute;gendaire de la SNCF. Malheureusement, c'est souvent un ressenti subjectif, et lorsqu'il s'agit de trouver des donn&eacute;es chiffr&eacute;es objectives, on se confronte &agrave; la subjectivit&eacute; de la SNCF (c&rsquo;est un peu comme le nombre de manifestants selon la police ou les syndicats).<br /><br />Une base de <strong>Kafka</strong>, un soup&ccedil;on d&rsquo;<strong>Elasticsearch</strong>, un zeste de <strong>Kubernetes</strong>, saupoudrer de <strong>Jenkins-X</strong>, voil&agrave; notre recette pour concevoir un syst&egrave;me de pr&eacute;diction de retards de trains bas&eacute; sur les observations des utilisateurs.<br /><br />Venez d&eacute;guster le r&eacute;sultat en notre compagnie !<br />Les slides sont visibles sur <a href=\"https://www.flickr.com/photos/162459903@N02/46919285601/in/album-72157706183887935/\" target=\"_blank\">slides.google.com </a>Et le code utilis&eacute; est sur <a href=\"https://github.com/Riduidel/snowcamp-2019\" target=\"_blank\">Github</a><br />",
    "seats": "0",
    "goers": "41",
    "invite_only": "N",
    "venue": "Chrome 2 + 3 + 4",
    "company": "Français",
    "id": "b47fe0e40d4713d3b6c883c46dcb0960",
    "venue_id": "836698",
    "speakers": "Logan HAUSPIE, Nicolas Delsaux"
  },
  {
    "event_key": "26",
    "active": "Y",
    "name": "BugZero Kata",
    "event_start": "2019-01-23 14:00:00",
    "event_end": "2019-01-23 17:00:00",
    "event_type": "Method",
    "event_subtype": "University",
    "description": "Vous allez étudier des bugs afin de comprendre les faiblesses dans le design qui a permi et facilité leur introduction. Une fois compris vous allez inventer de designs alternatifs qui rendraient impossible ou du moins peu probable leur introducition. Nous allons également chercher des faiblesses du design, où ce serait probable que l'on introduise un bug dans le futur.<br><br>En comprenant mieux puis en corrigeant la cause racine des bugs, nous tranformons les échecs de hier en force pour demain.<br><br>Le geste à répéter :<br><br>1. Identifier soit une faiblesse du design susceptible de causer un bug lorsque l'on étend le code, soit un bug existant.<br>2. Expliquer comment le design actuel a contribué à l'introduction du bug ou comment il risque d'y contribuer dans le futur.<br>3. Trouvez un design qui rend impossible ce bug ou du moins qui le rend peu probab<em><strong>le.<br><br>Pré-requis :</strong></em> faire tourner un des langages du répo <a href=\"https://github.com/martinsson/BugsZero-Kata\" rel=\"noopener noreferrer\" target=\"_blank\">https://github.com/martinsson/BugsZero-Kata</a>",
    "seats": "0",
    "goers": "8",
    "invite_only": "N",
    "venue": "Workshop Amphi",
    "company": "Français",
    "id": "bc788ae49fb4e296c0fa4dcdb3bf5d40",
    "venue_id": "836701",
    "speakers": "Johan Martinsson"
  },
  {
    "event_key": "16",
    "active": "Y",
    "name": "DevSecOps ou comment faire aimer la sécurité aux Devs (-IoT) ?",
    "event_start": "2019-01-24 11:45:00",
    "event_end": "2019-01-24 12:30:00",
    "event_type": "Security",
    "event_subtype": "Conference",
    "description": "Sur le m&ecirc;me concept que DevOps, le mouvement DevSecOps vise &agrave; apporter un peu de s&eacute;curit&eacute; au quotidien du d&eacute;veloppeur, en faisant collaborer les &eacute;quipes Sec et Dev.<br /> <br /> Int&eacute;grer correctement l&rsquo;ensemble des aspects s&eacute;curit&eacute; dans le cycle de d&eacute;veloppement logiciel n&rsquo;est pas toujours ais&eacute;, implique parfois des efforts cons&eacute;quents et rebute donc la communaut&eacute; de d&eacute;veloppeurs.<br /> Mais c&rsquo;est &agrave; ce prix que nous pouvons avoir confiance dans la qualit&eacute; des services d&eacute;velopp&eacute;s. Notons que 61% des applications d&eacute;velopp&eacute;es &eacute;chouent au test de conformit&eacute; de l&rsquo;OWASP.<br /> <br /> Durant ce talk, nous pr&eacute;senterons ce mouvement, ainsi que les diff&eacute;rentes m&eacute;thodologies propos&eacute;es.<br /> Nous proposerons d&rsquo;en d&eacute;crire les diff&eacute;rents aspects de leur mise en pratique avec des exemple concrets, rapidement applicables.<br /> Le coeur de la pr&eacute;sentation s&rsquo;articulera autour de notre retour d'exp&eacute;rience de mise en application de DevSecOps au sein de l&rsquo;&eacute;quipe *&ldquo;Full Stack&rdquo;* ** d&rsquo;Rtone IoT Makers.<br /> Nous verrons ainsi qu'int&eacute;grer les aspects s&eacute;curit&eacute; dans un cycle de d&eacute;veloppement logiciel permet d&rsquo;am&eacute;liorer la qualit&eacute; global du code produit, tout en r&eacute;duisant les failles de s&eacute;curit&eacute; et le co&ucirc;t des correctifs.<br /> <br /> ** Full Stack : dev. hardware, firmware, embarqu&eacute;, mobile, web et cloud :)",
    "seats": "0",
    "goers": "40",
    "invite_only": "N",
    "venue": "Titane 2",
    "company": "Français",
    "id": "c1dfcce03ce2c0ffb954baf6fe947e8a",
    "venue_id": "836688",
    "speakers": "Alexis DUQUE"
  },
  {
    "event_key": "20",
    "active": "Y",
    "name": "Zero-Knowledge Architecture",
    "event_start": "2019-01-24 11:45:00",
    "event_end": "2019-01-24 12:30:00",
    "event_type": "Architecture",
    "event_subtype": "Conference",
    "description": "Did you already hear about the ZKA pattern? Zero Knowledge stands for a pattern where no-one but the owner is aware of the content of the data. It's mainly in use in the Zero Knowledge Proof pattern, an authorization design. Despite its powerful concepts, Zero Knowledge patterns remain misunderstood.<br /> <br /> In fact, there's a small amount of contents about what Zero Knowledge really is, what it implies, and how to use it. Architectures that use ZK by Design are nearly undocumented. It's a widely unknown territory.<br /> <br /> Here's a wide and comprehensive talk about ZKA, with cryptography, keys exchange, data storage, blob secured transfers, privacy use-cases, and many more. Finally, we'll be focused on how to implement it in a web browser environment which is unsecured by design (because always bet on JavaScript).<br /> <br /> Let's see how we can build secured (web)apps to improve our users' privacy.<br />---<br />Slides online here : https://talks.m4dz.net/zka/fr/<br />",
    "seats": "0",
    "goers": "45",
    "invite_only": "N",
    "venue": "Amphi",
    "company": "Français",
    "id": "c72558af76998fe3ad2e999a7a0dab71",
    "venue_id": "836673",
    "speakers": "m4dz"
  },
  {
    "event_key": "19",
    "active": "Y",
    "name": "Hands-on lab : Redécouvrir l'Univers connu avec des dataset de la NASA",
    "event_start": "2019-01-23 14:00:00",
    "event_end": "2019-01-23 17:00:00",
    "event_type": "Data",
    "event_subtype": "University",
    "description": "Cela fait des années que l’humanité explore le ciel, rêvant de voyages intersidérales et de nouvelles colonies planétaires. Et toi, as-tu envie de partir avec nous à la découverte de l’univers ?<br><br>Il se trouve que la NASA possède un formidable jeu de données publiques, notamment celui qui est utilisé pour la recherche d’exoplanètes, c’est-à-dire de planètes situées en dehors de notre système solaire.<br>C’est ainsi que le projet HelloExoWorld a vu le jour. Son objectif ? Voir des développeurs fans d’analyse de données sont capables de participer à la recherche d’exoplanètes en utilisant ces données publiques de la NASA. Vous découvrirez durant ce talk la création du projet, les résultats actuels, ainsi que son évolution vers une communauté active.<br><br><em><strong>Notes du speaker :</strong></em><br>Le Hands-on est un dérivé de la conférence donnée au premier Warp10Meetup en octobre dernier (slides disponibles ici). L’idée est de permettre aux participants de s’initier à l’analyse de séries temporelles grâce à un jeu de données disponible en opendata.<br>Derrière cette initiative il y a une association, HelloExoWorld et une communauté de passionnés de l’informatique et de l’espace qui essaie de prouver qu’on peut aider la recherche depuis notre rôle de scientifique citoyen.<br>Le site https://helloexo.world contient tous les liens vers les ressources disponibles (Medium, Github, Google Groups).<br>On a fait ce lab au BreizhCamp, Devoxx France, RivieraDev et Sunny Tech, et on aimerait vraiment descendre à Grenoble pour que un nouveau publique puisse se l’approprier.<br>Par rapport aux speakers, nous avons tous pas mal d’expérience (Devoxx Belgique, Devoxx France, MixIT, BreizhCamp, DevFest Nantes…) et on est surtout des passionnés. Et on aime particulièrement le format lab, car pour nous c’est la meilleure façon de transmettre cette passion.<br><br>Lien sur l'atelier : <a href=\"https://helloexoworld.github.io/hew-hands-on\" rel=\"noopener noreferrer\" target=\"_blank\">https://helloexoworld.github.io/hew-hands-on</a><br><br>At the end of this workshop, you will:<br><ul><li>Learn about <a href=\"http://www.warp10.io\">Warp10</a>, a platform designed to collect, store and manipulate sensor data.</li><li>learn about a NASA mission called Kepler</li><li>learn about time-series&nbsp;</li><li>learn WarpScript, a language designed to manipulate time-series</li></ul><br>",
    "seats": "0",
    "goers": "3",
    "invite_only": "N",
    "venue": "Chrome 3",
    "company": "Français",
    "id": "c99a2187d9b9d50aaa7141f9e51fbc97",
    "venue_id": "836695",
    "speakers": "Horacio Gonzalez, Emmanuel Feller"
  },
  {
    "event_key": "51",
    "active": "Y",
    "name": "Le mot de l’accueil / Welcome",
    "event_start": "2019-01-24 09:00:00",
    "event_end": "2019-01-24 09:20:00",
    "seats": "0",
    "goers": "84",
    "invite_only": "N",
    "venue": "Amphi",
    "id": "cdeaf7a7bafea0ab140c6910759f6e40",
    "venue_id": "836673"
  },
  {
    "event_key": "9",
    "active": "Y",
    "name": "Les mains dans Spark",
    "event_start": "2019-01-23 09:30:00",
    "event_end": "2019-01-23 12:30:00",
    "event_type": "Data",
    "event_subtype": "University",
    "description": "Le workshop est ouvert à tous.<br>L'idée est de découvrir et commencer à jouer avec Spark.<br><br>Les participants en tireront une première vision de ce framework et auront vraiment pu toucher un peu son API.<br>Ils verront quelques cas d'usage concrets de traitement de données.<br><strong><em><br>Pré-requis :</em></strong> accès à<a href=\"https://community.cloud.databricks.com\" rel=\"noopener noreferrer\" target=\"_blank\">&nbsp;https://community.cloud.databricks.com</a>&nbsp;ainsi que l'accès à une adresse mail des participants (gmail, outlook, yahoo, etc) afin de se créer un compte sur le site et de jouer directement avec sans avoir besoin de rien installer.<br>Mais au cas où, installer <em><u>avant</u></em> l'atelier :<br>- Java JDK 8<br>- Scala 2.11.x<br>- Apache Spark 2.4.x ou Apache Spark 2.3.x.",
    "seats": "0",
    "goers": "5",
    "invite_only": "N",
    "venue": "Chrome 1",
    "company": "Français",
    "id": "dfcb57d8dc1143fa4948806b607f63fd",
    "venue_id": "836691",
    "speakers": "Nastasia Saby"
  },
  {
    "event_key": "54",
    "active": "Y",
    "name": "Lunch",
    "event_start": "2019-01-23 12:30:00",
    "event_end": "2019-01-23 14:00:00",
    "seats": "0",
    "goers": "13",
    "invite_only": "N",
    "venue": "Hall Sponsors",
    "id": "e1b7542f4264e89b310fd336dc43e967",
    "venue_id": "836676"
  },
  {
    "event_key": "47",
    "active": "Y",
    "name": "Pour des logiciels de qualités, dites stop au TDD et passez au TDD ! ¯\\_(ツ)_/¯",
    "event_start": "2019-01-23 09:30:00",
    "event_end": "2019-01-23 12:30:00",
    "event_type": "Method",
    "event_subtype": "University",
    "description": "Deux piliers du Software Craftsmanship manifesto sont : des logiciels bien conçus et l'ajout constant de la valeur. Pourtant les développeurs ont tendance à subir leur premier outil : le langage de programmation, et développent pour lutter contre un outil mal choisi des pratiques telles que le TDD à l'excès... Avec le Type Driven Design, toutes une catégorie de tests peut être encodée dans votre application grâces à un système de types algébriques, et surtout vous permet de mieux raisonner votre application.<br>Avec la montée en puissance de langage statiquement typé et tel que F#, OCaml, Haskell, Scala, Swift, Kotlin, ReasonML, Rust, Nim, ... c'est un sujet d'actualité.<br><br><strong><em>Note de l'auteur :</em></strong> j’ai eu l’occasion de tester ce workshop lors de l’agile tour Lille. Actuellement il est prêt en ReasonML, OCaml, Rust et Kotlin sera ajouté pour le SnowCamp.<br>Il est tout à fait accessible à une personne ne connaissant rien aux ADT (c’est même au final l’objectif premier de ce workshop que d’amener ce concept) et une itération 0 est même prévu pour découvrir le langage choisi pour quelqu’un qui ne le connaîtrait pas. ReasonML est le plus accessible pour quelqu’un qui ne connait aucun des langages car pose moins de problème de syntaxe.<br>Mais dans l’absolu quelqu’un qui souhaiterait participer au workshop pour découvrir l’un des langages proposé est aussi une bonne motivation pour participer. Lors de l’agile tour un groupe a choisi d’utiliser le temps disponible pour découvrir RUST (sûrement le moins accessible des langages proposé) et cela c’est très bien passé, je pense même qu’ils ont tiré une certaine fierté d’avoir pu mettre en œuvre certains concepts même sans aller au bout de l’exercice.<br>Le but est de jouer avec les systèmes de types et pas nécessairement avec la programmation fonctionnelle. L’atelier ce veux principalement orienté pour des débutants en programmation statiquement (bien<br>",
    "seats": "0",
    "goers": "12",
    "invite_only": "N",
    "venue": "Workshop Amphi",
    "company": "Français",
    "id": "e1dd874c9a0ce6da073e59677ad71e46",
    "venue_id": "836701",
    "speakers": "Thomas Haessle"
  },
  {
    "event_key": "17",
    "active": "Y",
    "name": "Spring Boot with Kotlin, functional configuration and GraalVM",
    "event_start": "2019-01-25 15:00:00",
    "event_end": "2019-01-25 15:45:00",
    "event_type": "Language & Paradigms",
    "event_subtype": "Conference",
    "description": "In this talk, I will live code a Spring Boot application with no annotation that will run as a native image compiled with GraalVM. This application will leverage Kofu configuration, a Kotlin DSL designed to configure your application in a functional way.<br /> <br /> I will also present various features currently incubated in Spring Fu:<br /> <br /> * Kofu (Kotlin DSL) and Jafu (Java DSL) configuration for Spring Boot<br /> * Minimal set of features enabled by default<br /> * No classpath scanning, no feature enabled based on classpath detection<br /> * Both declarative (via the DSL) and programmatic (code auto-complete, allow any kind of if, for statements)<br /> * Functional configuration based on pure lambdas<br /> * Minimal reflection usage, no CGLIB proxy, no annotation processing<br /> * Faster startup and lower memory consumption<br /> * GraalVM native images support<br /> * Reactive SQL via R2DBC<br /> * Coroutines web and persistence API<br /> <br /> I will explain where we are, what we learnt, and what's coming next in term of new Spring Framework and Spring Boot features.",
    "seats": "0",
    "goers": "28",
    "invite_only": "N",
    "venue": "Titane 2",
    "company": "Français",
    "id": "e2bfab26139bb9865a426fbac54868d7",
    "venue_id": "836688",
    "speakers": "Sébastien Deleuze"
  },
  {
    "event_key": "29",
    "active": "Y",
    "name": "Building an app with NativeScript and Firebase",
    "event_start": "2019-01-23 14:00:00",
    "event_end": "2019-01-23 17:00:00",
    "event_type": "Web",
    "event_subtype": "University",
    "description": "Are you a web developer who always wanted to write an app for both iOS and Android, but want to write it only once? Do you want a true, performant, native app, but don&rsquo;t want to learn yet another language, yet another framework and get used to yet another IDE? With NativeScript, this is easier than you might think! NativeScript is an open source framework that lets you build truly native apps from one code base using Angular, Vue.js, TypeScript or JavaScript. You will get 100% access to all native APIs directly from your JavaScript or TypeScript code. In the workshop we will build a robust app with NativeScript. For the backend we use Firebase to speed up development.<br /><br /><br />To get started you'll need the following pre-requisites:<br />Windows, Mac, or Linux computer<br />JavaScript and TypeScript experience. No prior NativeScript experience is necessary.&nbsp;<br />All attendees must have <a href=\"https://nodejs.org/\" target=\"_blank\">node.js</a> installed&nbsp;<br /> and the NativeScript CLI installed (&nbsp;<em>[sudo] npm install -g nativescript&nbsp;</em>)<br />Additionally, please also&nbsp;<a href=\"https://code.visualstudio.com/download\" target=\"_blank\">download and install Visual Studio Code</a>.<br />",
    "seats": "0",
    "goers": "5",
    "invite_only": "N",
    "venue": "Chrome 1",
    "company": "English",
    "id": "e3621e8d81c9e5af2911f24a1f04a672",
    "venue_id": "836691",
    "speakers": "Peter Eijgermans"
  },
  {
    "event_key": "46",
    "active": "Y",
    "name": "Rust 101",
    "event_start": "2019-01-24 14:00:00",
    "event_end": "2019-01-24 14:45:00",
    "event_type": "Language & Paradigms",
    "event_subtype": "Conference",
    "description": "Jusqu'à présent, si nous devions choisir un langage pour écrire du bas niveau, nous choisirions généralement entre C et C++.<br /> <br /> Une nouvelle option s'offre à nous: Rust, un langage de programmation système conçu pour la manipulation sécurisée de la mémoire, avec une synthaxe haut niveau pour le développement bas niveau et également utilisé sur le Web pour les serveurs HTTP ou Web assembly.<br /> <br /> Cette présentation donnera un aperçu des problématiques que Rust tente de résoudre et comment débuter avec ce langage.",
    "seats": "0",
    "goers": "18",
    "invite_only": "N",
    "venue": "Amphi",
    "company": "Français",
    "id": "e6228a11b17e5704f684137c7d391d40",
    "venue_id": "836673",
    "speakers": "Alessio Coltellacci"
  },
  {
    "event_key": "1",
    "active": "Y",
    "name": "Faites tourner les bouteilles en 3D, le ZeniBar passe à WebGL2",
    "event_start": "2019-01-24 11:45:00",
    "event_end": "2019-01-24 12:30:00",
    "event_type": "Web",
    "event_subtype": "Conference",
    "description": "Le ZeniBar, bar entièrement connecté, connaît désormais très bien ses clients et gère ses stocks grâce au machine learning.<br /> <br /> Apportons maintenant de l'animation aux clients en leur offrant une application en 3D en full WebGL2 vanilla sur les écrans du bar.<br /> <br /> Apprenons pas à pas les concepts et le code WebGL, depuis la rasterisation jusqu'aux shaders avancés en passant par les quaternions, les lumières, caméras, ...",
    "seats": "0",
    "goers": "18",
    "invite_only": "N",
    "venue": "Chrome 1",
    "company": "Français",
    "id": "e75d3800b4d24a53a4edb57d17b1ece4",
    "venue_id": "836691",
    "speakers": "Gwennael BUCHET, Logan HAUSPIE"
  },
  {
    "event_key": "2",
    "active": "Y",
    "name": "Monitoring OVH: 300k servers, 27 DCs and one Metrics platform",
    "event_start": "2019-01-24 15:00:00",
    "event_end": "2019-01-24 15:45:00",
    "event_type": "DevOps / Cloud / Container & Scaling",
    "event_subtype": "Conference",
    "description": "What to do when you must monitor the whole infrastructure of the biggest European hosting and cloud provider? How to choose a tool when the most used ones fail to scale to your needs? How to build an Metrics platform to unify, conciliate and replace years of fragmented legacy partial solutions? <br /> <br /> In this talk we will relate our experience building and maintaining OVH Metrics, the platform used to monitor all OVH infrastructure. We needed to go to places where most monitoring solutions hadn't gone before, it needed to operate at the scale of the biggest European hosting and cloud providers: 27 data centers, more than 300k servers (bare metal!), and hundreds of products to fulfill our mission to host 1.3 million customers. <br /> <br /> You will hear about time series, about open source solutions pushed to the limit, about HBase clusters operated at the extreme, and how about a small team leveraged the power of a handful of open source solution and lots of coding glue to build one of the most performant monitoring solutions ever.",
    "seats": "0",
    "goers": "38",
    "invite_only": "N",
    "venue": "Amphi",
    "company": "Français",
    "id": "ece4a4769a0ca7734b7898233c8c4e77",
    "venue_id": "836673",
    "speakers": "Horacio Gonzalez"
  },
  {
    "event_key": "7",
    "active": "Y",
    "name": "Istio, le meilleur ami de votre cluster K8S",
    "event_start": "2019-01-25 15:00:00",
    "event_end": "2019-01-25 15:45:00",
    "event_type": "DevOps / Cloud / Container & Scaling",
    "event_subtype": "Conference",
    "description": "Dans un monde distribu&eacute;, nous sommes confront&eacute;s &agrave; de nouveaux d&eacute;fis. Les notions de circuit-breaker, de retry, de timeout, de blue-green deployment, d&rsquo;A/B testing, de pool-ejection&hellip; viennent remplacer nos anciens probl&egrave;mes de monolithe.<br /><br />Istio va nous aider sur tous ces points... et m&ecirc;me plus ! ️<br /><br />Dans cette pr&eacute;sentation nous allons faire le tour de l'outillage n&eacute;cessaire (&eacute;manant de la stack Netflix principalement) dans un environnement micro services. De ce fait, nous constaterons les probl&eacute;matiques que posent le nouveau paradigme de d&eacute;veloppement sur K8S (et autres orchestrateurs).<br /><br />Nous allons faire un tour d'horizon des diff&eacute;rentes fonctionnalit&eacute;s misent &agrave; disposition au sein d'Istio pour vous faciliter la vie. De plus, nous allons faire un focus sur l'architecture et le fonctionnement interne d'Istio (Envoy, side-car et autres outils comme Jaeger, Prometheus &amp; cie)<br /><br /><strong>Lien vers les slides</strong>:&nbsp;http://bit.ly/istio-and-k8s-bff",
    "seats": "0",
    "goers": "28",
    "invite_only": "N",
    "venue": "Amphi",
    "company": "Français",
    "id": "f288c6725cf1b42bbce41f6fcf0cbbeb",
    "venue_id": "836673",
    "speakers": "Kevin Davin"
  },
  {
    "event_key": "31",
    "active": "Y",
    "name": "Retour d'expérience après un an de VueJS en prod",
    "event_start": "2019-01-25 14:00:00",
    "event_end": "2019-01-25 14:45:00",
    "event_type": "Web",
    "event_subtype": "Conference",
    "description": "Nous venons de passer 1 an sur un projet de refonte de SI en micro services ayant tous un front en VueJS. Nous avons donc pu explorer beaucoup de partie du framework (m&ecirc;me si c'est une librairie). Nous allons vous passer en revue notre stack et essayer de vous donner des conseils sur comment faire un beau projet en VueJS. Voici ce que nous aborderons :<br /> \r\n<ul>\r\n<li>vuex, le store interne de vue</li>\r\n<li>vue-router</li>\r\n<li>vue-test-utils, tests unitaites et d'int&eacute;gration</li>\r\n<li>vue-cli 2 puis 3</li>\r\n<li>plugin vue avec une librairie interne</li>\r\n<li>comment passer outre certains probl&egrave;mes de performance (trop de r&eacute;activit&eacute; dans ce framework)</li>\r\n<li>gestion des appels r&eacute;seaux</li>\r\n<li>gestion des objets m&eacute;tiers</li>\r\n<li>ce que l'on aurait voulu mettre en place et ce que l'on vous conseille de faire</li>\r\n</ul>\r\nSLIDES :&nbsp;<a href=\"https://docs.google.com/presentation/d/e/2PACX-1vTxiSF5BC-mM-Liejq_e5kQBCIFuzhkBVFP29Ifn4UPtswdH_4QbL_-78mfxNmbA1KsnbeYg8L6PT8Q/pub?start=false&amp;loop=false&amp;delayms=3000\" target=\"_blank\">https://docs.google.com/presentation/d/e/2PACX-1vTxiSF5BC-mM-Liejq_e5kQBCIFuzhkBVFP29Ifn4UPtswdH_4QbL_-78mfxNmbA1KsnbeYg8L6PT8Q/pub?start=false&amp;loop=false&amp;delayms=3000</a>",
    "seats": "0",
    "goers": "38",
    "invite_only": "N",
    "venue": "Chrome 1",
    "company": "Français",
    "id": "f31bdce9fceed31748d715e55abd4b1c",
    "venue_id": "836691",
    "speakers": "Jules Hablot, Mathieu Mure"
  },
  {
    "event_key": "59",
    "active": "Y",
    "name": "Welcome / Breakfast",
    "event_start": "2019-01-24 08:00:00",
    "event_end": "2019-01-24 09:00:00",
    "seats": "0",
    "goers": "69",
    "invite_only": "N",
    "venue": "Hall Sponsors",
    "id": "f440364e1d8cb66da5b32af3f0ead3fc",
    "venue_id": "836676"
  },
  {
    "event_key": "4",
    "active": "Y",
    "name": "Kubernetes 101",
    "event_start": "2019-01-23 09:30:00",
    "event_end": "2019-01-23 12:30:00",
    "event_type": "DevOps / Cloud / Container & Scaling",
    "event_subtype": "University",
    "description": "Workshop de formation au basique de Kubernetes, afin de bien démarrer et commencer à travailler avec Kubernetes",
    "seats": "0",
    "goers": "11",
    "invite_only": "N",
    "venue": "Chrome 4",
    "company": "Français",
    "id": "f953cf05f4749d80c4ceb904e54bebb8",
    "venue_id": "836697",
    "speakers": "Laurent Grangeau, Piot Ludovic"
  }
]